
## Plan Result (prod)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_PORT


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.KeyVault/vaults/sscs-prod"
      + name                    = "tribunals-api-POSTGRES-PASS"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.KeyVault/vaults/sscs-prod"
      + name                    = "tribunals-api-POSTGRES-USER"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.KeyVault/vaults/sscs-prod"
      + name                    = "tribunals-api-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.KeyVault/vaults/sscs-prod"
      + name                    = "tribunals-api-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sscs-prod/providers/Microsoft.KeyVault/vaults/sscs-prod"
      + name                    = "tribunals-api-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":4062,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->